### Terraform Plan Output
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "vpc_flow_log_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-east-2:743794601996:log-group:vpc-z6mdk-flow-logs",
            ]
        }
    }

  # module.vpc.aws_cloudwatch_log_group.network_flow_logging[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "network_flow_logging" {
        id                = "vpc-z6mdk-flow-logs"
        name              = "vpc-z6mdk-flow-logs"
      ~ retention_in_days = 0 -> 365
        tags              = {}
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-036b81b5c2e4cbd13"
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "vpc_flow_log_role_policy" {
        id     = "vpc-z6mdk-vpc-flow-role:vpc-z6mdk-vpc-flow-policy"
        name   = "vpc-z6mdk-vpc-flow-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-2:743794601996:log-group:vpc-z6mdk-flow-logs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```